const KEYBOARD_EN = [['`', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'Backspace'],
  ['Tab', 'q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p', '[', ']', '\\'],
  ['CapsLock', 'a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l', ';', '\'', 'Enter'],
  ['Shift', 'z', 'x', 'c', 'v', 'b', 'n', 'm', ',', '.', '/', '\u25B2', 'Shift'],
  ['Ctrl', 'Win', 'Alt', 'Space', '\u25C0', '\u25BC', '\u25B6', 'Ctrl']];

const KEYBOARD_EN_SHIFT = [['~', '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '_', '=', 'Backspace'],
  ['Tab', 'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P', '{', '}', '|'],
  ['CapsLock', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', ':', '"', 'Enter'],
  ['Shift', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', '<', '>', '?', '\u25B2', 'Shift'],
  ['Ctrl', 'Win', 'Alt', 'Space', '\u25C0', '\u25BC', '\u25B6', 'Ctrl']];

const KEYBOARD_RU = [['`', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', '-', '=', 'Backspace'],
  ['Tab', 'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', '\\'],
  ['CapsLock', 'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э', 'Enter'],
  ['Shift', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', '.', '\u25B2', 'Shift'],
  ['Ctrl', 'Win', 'Alt', 'Space', '\u25C0', '\u25BC', '\u25B6', 'Ctrl']];

const KEYBOARD_RU_SHIFT = [['~', '!', '@', '#', '$', '%', '^', '&', '*', '(', ')', '_', '=', 'Backspace'],
  ['Tab', 'Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ', '|'],
  ['CapsLock', 'Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э', 'Enter'],
  ['Shift', 'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', ',', '\u25B2', 'Shift'],
  ['Ctrl', 'Win', 'Alt', 'Space', '\u25C0', '\u25BC', '\u25B6', 'Ctrl']];

export {
  KEYBOARD_EN, KEYBOARD_EN_SHIFT, KEYBOARD_RU, KEYBOARD_RU_SHIFT,
};
